{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020, 2021)",
        "GPA: 3.3/4.0"
      ],
      "degree": "Bachelor of Sciences",
      "department": "Computer Science",
      "duration": "2018-2022",
      "school_name": "Toronto Metropolitan University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_PetarKandic",
  "highlighted_projects": [
    {
      "description": "Designed a web tutoring application. The goal was to develop a mock-up of a real tutoring application, with a log-in functionality. In addition to HTML/CSS, JavaScript was used to construct the active elements. The login system uses SQL to store and retrieve the user's log-in info. The application displays a range of subjects for which tutors are available. I enlisted several friends to test this application; this experience led to improvements in the UI. The application runs on the local machine.",
      "git_url": "https://github.com/pkandic4/TutoringApplication",
      "name": "Tutoring Web Application"
    },
    {
      "description": "Programmed a fully functional car dealership simulator in Java. This application simulates larger, commercial applications. A list of cars - including makes, prices, and other information - is imported from a text file. Available commands include the ability to buy cars, return them, and to filter the list based on certain criteria.  There are also advanced commands, including filtering the sales team based on their transactions. Several Java data structures are used, including HashMaps to handle sales team data. The application was tested extensively throughout the development process, and runs on the local machine.",
      "git_url": "https://github.com/pkandic4/CarDealershipSimulator",
      "name": "Java Car Dealership Simulator"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed two Bash scripts to monitor the status of a Linux system. These shell scripts are used to gather data on system memory and performance. The data is stored on a PostgreSQL database, hosted on a Docker container. The scripts are automatically run every minute, using a Crontab job. These scripts, and their automation, saves time over having to manually check the system's status.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Petar Kandic",
  "others": [
    {
      "bullets": [
        "Organized a competitive soccer league",
        "Captained several competitive basketball teams"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Working as a software engineer to design and program applications. I have developed Bash scripts (along with PostgreSQL and Docker) to gather and store data on Linux systems. Our group uses the Agile model, which allows us to discuss our progress on different projects. In particular, daily scrums enable us to understand what we have done and what we plan to do, enabling a more efficient workflow.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "Fiix Software",
      "description": "Developed web scraping software using Python (including the pandas and boto3 libraries). In addition, I used AWS (including crontabs) and Python, to enter the gathered data into SQL databases at a regular interval. The scraper I developed executed 35% faster than its predecessor. This allowed the company to process data at a faster rate than before.",
      "duration": "2021",
      "title": "Data Engineer"
    }
  ],
  "skills": {
    "competent": [
      "HTML/CSS",
      "JavaScript",
      "Bootstrap",
      "Python",
      "Rust"
    ],
    "familiar": [
      "Docker",
      "AWS",
      "Functional Languages/Elixir",
      "C#",
      "C++"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "C"
    ]
  },
  "summary": "I am a software engineer with 5 years of experience developing applications. Over the course of my professional and personal experience, I have gained a significant understanding of languages such as Java and C, as well as commonly-used technologies, including Linux and Git. While back-end development is my greatest strength, I also have experience designing websites, utilizing HTML/CSS. I have worked both alone and as part of a team, accomplising goals alongside my coworkers. Whenever new challenges arise, I am prepared to take them on, using whal I have learned."
}
